<a href="https://colab.research.google.com/github/Simrita100/Python/blob/main/Practice_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
dict1 = {
    "name":['Simrita','Krypto','Sharon','Kailyn'],
    "marks":[100, 60, 40, 90],
    "city":['Puri','Brooklyn','Kyoto','Florence']
}

In [ ]:
df = pd.DataFrame(dict1)

In [ ]:
df

      name  marks      city
0  Simrita    100      Puri
1   Krypto     60  Brooklyn
2   Sharon     40     Kyoto
3   Kailyn     90  Florence

In [ ]:
df.to_csv('Friends.csv')

In [ ]:
df.to_csv('Friends_index_false.csv', index=False)

In [ ]:
df.head(2)

      name  marks      city
0  Simrita    100      Puri
1   Krypto     60  Brooklyn

In [ ]:
df.tail(2)

     name  marks      city
2  Sharon     40     Kyoto
3  Kailyn     90  Florence

In [ ]:
df.head()

      name  marks      city
0  Simrita    100      Puri
1   Krypto     60  Brooklyn
2   Sharon     40     Kyoto
3   Kailyn     90  Florence

In [ ]:
df.tail()

      name  marks      city
0  Simrita    100      Puri
1   Krypto     60  Brooklyn
2   Sharon     40     Kyoto
3   Kailyn     90  Florence

In [ ]:
df.describe()

            marks
count    4.000000
mean    72.500000
std     27.537853
min     40.000000
25%     55.000000
50%     75.000000
75%     92.500000
max    100.000000

In [ ]:
Train = pd.read_csv('Train.csv')

In [ ]:
Train

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Unnamed: 0.1.1.1,Unnamed: 0.1.1.1.1,Unnamed: 0.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1,Train numbers,Speed,City
0,0,0,0,0,0,0,0,0,A601,60,Puri
1,1,1,1,1,1,1,1,1,A601,76,Bhubaneswar
2,2,2,2,2,2,2,2,2,B701,80,Mumbai
3,3,3,3,3,3,3,3,3,B801,86,Pune

In [ ]:
Train['Speed']

0    60
1    76
2    80
3    86
Name: Speed, dtype: int64

In [ ]:
Train['Speed'][0]

60

In [ ]:
Train['Speed'][0] = 60

<ipython-input-16-427a98f70e7c>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Train['Speed'][0] = 60

In [ ]:
Train

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Unnamed: 0.1.1.1,Unnamed: 0.1.1.1.1,Unnamed: 0.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1,Train numbers,Speed,City
0,0,0,0,0,0,0,0,0,A601,60,Puri
1,1,1,1,1,1,1,1,1,A601,76,Bhubaneswar
2,2,2,2,2,2,2,2,2,B701,80,Mumbai
3,3,3,3,3,3,3,3,3,B801,86,Pune

In [ ]:
Train.to_csv('Train.csv')

In [ ]:
Train.index = ['first', 'second', 'third', 'fourth']

In [ ]:
Train

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Unnamed: 0.1.1.1,Unnamed: 0.1.1.1.1,Unnamed: 0.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1,Train numbers,Speed,City
first,0,0,0,0,0,0,0,0,A601,60,Puri
second,1,1,1,1,1,1,1,1,A601,76,Bhubaneswar
third,2,2,2,2,2,2,2,2,B701,80,Mumbai
fourth,3,3,3,3,3,3,3,3,B801,86,Pune

In [ ]:
ser = pd.Series(np.random.rand(34))

In [ ]:
ser

0     0.943810
1     0.395214
2     0.954456
3     0.535347
4     0.346918
5     0.764780
6     0.388298
7     0.249935
8     0.888423
9     0.721039
10    0.184236
11    0.702529
12    0.235807
13    0.358432
14    0.766559
15    0.109076
16    0.753924
17    0.718576
18    0.338945
19    0.309720
20    0.595112
21    0.546982
22    0.767211
23    0.862131
24    0.912477
25    0.825519
26    0.858434
27    0.848869
28    0.226438
29    0.531228
30    0.312246
31    0.334578
32    0.398855
33    0.299324
dtype: float64

In [ ]:
type(ser)

pandas.core.series.Series

In [ ]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [ ]:
newdf

            0         1         2         3         4
0    0.098277  0.004619  0.993468  0.613271  0.856091
1    0.550326  0.541972  0.035519  0.919676  0.805929
2    0.113480  0.912265  0.834788  0.270516  0.088622
3    0.591618  0.720607  0.322464  0.407124  0.189336
4    0.566862  0.613896  0.957715  0.243204  0.690205
..        ...       ...       ...       ...       ...
329  0.027275  0.061100  0.903432  0.004597  0.517680
330  0.549459  0.847409  0.732187  0.249492  0.234655
331  0.684914  0.179314  0.245639  0.320080  0.675011
332  0.561526  0.516795  0.808024  0.003432  0.222852
333  0.729506  0.371557  0.599759  0.703007  0.719317

[334 rows x 5 columns]

In [ ]:
newdf.head()

          0         1         2         3         4
0  0.098277  0.004619  0.993468  0.613271  0.856091
1  0.550326  0.541972  0.035519  0.919676  0.805929
2  0.113480  0.912265  0.834788  0.270516  0.088622
3  0.591618  0.720607  0.322464  0.407124  0.189336
4  0.566862  0.613896  0.957715  0.243204  0.690205

In [ ]:
type(newdf)

pandas.core.frame.DataFrame

In [ ]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.510393    0.487793    0.506399    0.518142    0.477373
std      0.278342    0.282663    0.305184    0.311324    0.290988
min      0.003671    0.001379    0.004246    0.000713    0.008353
25%      0.257533    0.237965    0.250504    0.244203    0.233201
50%      0.534208    0.499313    0.498805    0.538385    0.457476
75%      0.740761    0.720463    0.795823    0.811259    0.717319
max      0.994972    0.998822    0.998906    0.993989    0.995831

In [ ]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [ ]:
newdf[0][0] = "Simrita"

In [ ]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [ ]:
newdf.head()

          0         1         2         3         4
0   Simrita  0.004619  0.993468  0.613271  0.856091
1  0.550326  0.541972  0.035519  0.919676  0.805929
2   0.11348  0.912265  0.834788  0.270516  0.088622
3  0.591618  0.720607  0.322464  0.407124  0.189336
4  0.566862  0.613896  0.957715  0.243204  0.690205

In [ ]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [ ]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [ ]:
newdf.to_numpy()

array([['Simrita', 0.0046189618189902415, 0.9934678112121699,
        0.6132714018931374, 0.8560909831980013],
       [0.5503258269471861, 0.5419722356833153, 0.03551927176785852,
        0.9196760552716776, 0.8059286763843992],
       [0.11347953643640307, 0.9122653787942433, 0.8347882480984261,
        0.270515500614089, 0.08862217174399367],
       ...,
       [0.6849141777523676, 0.17931384357323543, 0.24563905498229321,
        0.320080160103701, 0.6750106202092089],
       [0.5615262006798862, 0.5167946170908118, 0.8080235293497614,
        0.0034322463786276014, 0.22285245882521032],
       [0.7295060678750023, 0.3715573537077653, 0.5997589988225441,
        0.7030070390439368, 0.7193167611335385]], dtype=object)

In [ ]:
newdf[0][0] = 0.8

In [ ]:
newdf.head()

          0         1         2         3         4
0       0.8  0.004619  0.993468  0.613271  0.856091
1  0.550326  0.541972  0.035519  0.919676  0.805929
2   0.11348  0.912265  0.834788  0.270516  0.088622
3  0.591618  0.720607  0.322464  0.407124  0.189336
4  0.566862  0.613896  0.957715  0.243204  0.690205

In [ ]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.8,0.550326,0.11348,0.591618,0.566862,0.475852,0.465199,0.855631,0.136241,0.662775,...,0.821723,0.436254,0.577394,0.362307,0.642485,0.027275,0.549459,0.684914,0.561526,0.729506
1,0.004619,0.541972,0.912265,0.720607,0.613896,0.748468,0.903205,0.196325,0.050894,0.519792,...,0.652225,0.703256,0.680568,0.184161,0.135085,0.0611,0.847409,0.179314,0.516795,0.371557
2,0.993468,0.035519,0.834788,0.322464,0.957715,0.009888,0.011969,0.790914,0.350655,0.865196,...,0.941889,0.912239,0.857617,0.577812,0.981247,0.903432,0.732187,0.245639,0.808024,0.599759
3,0.613271,0.919676,0.270516,0.407124,0.243204,0.449755,0.003223,0.710723,0.82329,0.810332,...,0.912947,0.775967,0.03508,0.807918,0.400174,0.004597,0.249492,0.32008,0.003432,0.703007
4,0.856091,0.805929,0.088622,0.189336,0.690205,0.315482,0.63356,0.024629,0.024362,0.8387,...,0.032216,0.635877,0.105222,0.650896,0.0656,0.51768,0.234655,0.675011,0.222852,0.719317

In [ ]:
newdf.head()

          0         1         2         3         4
0       0.8  0.004619  0.993468  0.613271  0.856091
1  0.550326  0.541972  0.035519  0.919676  0.805929
2   0.11348  0.912265  0.834788  0.270516  0.088622
3  0.591618  0.720607  0.322464  0.407124  0.189336
4  0.566862  0.613896  0.957715  0.243204  0.690205

In [ ]:
newdf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333  0.729506  0.371557  0.599759  0.703007  0.719317
332  0.561526  0.516795  0.808024  0.003432  0.222852
331  0.684914  0.179314  0.245639  0.320080  0.675011
330  0.549459  0.847409  0.732187  0.249492  0.234655
329  0.027275  0.061100  0.903432  0.004597  0.517680
..        ...       ...       ...       ...       ...
4    0.566862  0.613896  0.957715  0.243204  0.690205
3    0.591618  0.720607  0.322464  0.407124  0.189336
2     0.11348  0.912265  0.834788  0.270516  0.088622
1    0.550326  0.541972  0.035519  0.919676  0.805929
0         0.8  0.004619  0.993468  0.613271  0.856091

[334 rows x 5 columns]

In [ ]:
newdf.sort_index(axis=0)

            0         1         2         3         4
0         0.8  0.004619  0.993468  0.613271  0.856091
1    0.550326  0.541972  0.035519  0.919676  0.805929
2     0.11348  0.912265  0.834788  0.270516  0.088622
3    0.591618  0.720607  0.322464  0.407124  0.189336
4    0.566862  0.613896  0.957715  0.243204  0.690205
..        ...       ...       ...       ...       ...
329  0.027275  0.061100  0.903432  0.004597  0.517680
330  0.549459  0.847409  0.732187  0.249492  0.234655
331  0.684914  0.179314  0.245639  0.320080  0.675011
332  0.561526  0.516795  0.808024  0.003432  0.222852
333  0.729506  0.371557  0.599759  0.703007  0.719317

[334 rows x 5 columns]

In [ ]:
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.856091  0.613271  0.993468  0.004619       0.8
1    0.805929  0.919676  0.035519  0.541972  0.550326
2    0.088622  0.270516  0.834788  0.912265   0.11348
3    0.189336  0.407124  0.322464  0.720607  0.591618
4    0.690205  0.243204  0.957715  0.613896  0.566862
..        ...       ...       ...       ...       ...
329  0.517680  0.004597  0.903432  0.061100  0.027275
330  0.234655  0.249492  0.732187  0.847409  0.549459
331  0.675011  0.320080  0.245639  0.179314  0.684914
332  0.222852  0.003432  0.808024  0.516795  0.561526
333  0.719317  0.703007  0.599759  0.371557  0.729506

[334 rows x 5 columns]

In [ ]:
newdf.head()

          0         1         2         3         4
0       0.8  0.004619  0.993468  0.613271  0.856091
1  0.550326  0.541972  0.035519  0.919676  0.805929
2   0.11348  0.912265  0.834788  0.270516  0.088622
3  0.591618  0.720607  0.322464  0.407124  0.189336
4  0.566862  0.613896  0.957715  0.243204  0.690205

In [ ]:
newdf[0]

0           0.8
1      0.550326
2       0.11348
3      0.591618
4      0.566862
         ...
329    0.027275
330    0.549459
331    0.684914
332    0.561526
333    0.729506
Name: 0, Length: 334, dtype: object

In [ ]:
type(newdf[0])

pandas.core.series.Series

In [ ]:
newdf2 = newdf.copy()

In [ ]:
newdf2[0][0] = 97835

<ipython-input-47-0d30d1adc0f7>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = 97835

In [ ]:
newdf

            0         1         2         3         4
0         0.8  0.004619  0.993468  0.613271  0.856091
1    0.550326  0.541972  0.035519  0.919676  0.805929
2     0.11348  0.912265  0.834788  0.270516  0.088622
3    0.591618  0.720607  0.322464  0.407124  0.189336
4    0.566862  0.613896  0.957715  0.243204  0.690205
..        ...       ...       ...       ...       ...
329  0.027275  0.061100  0.903432  0.004597  0.517680
330  0.549459  0.847409  0.732187  0.249492  0.234655
331  0.684914  0.179314  0.245639  0.320080  0.675011
332  0.561526  0.516795  0.808024  0.003432  0.222852
333  0.729506  0.371557  0.599759  0.703007  0.719317

[334 rows x 5 columns]

In [ ]:
newdf.loc[0,0] = 654

In [ ]:
newdf.head(2)

          0         1         2         3         4
0       654  0.004619  0.993468  0.613271  0.856091
1  0.550326  0.541972  0.035519  0.919676  0.805929

In [ ]:
newdf.columns = list("ABCDE")

In [ ]:
newdf.head(2)

          A         B         C         D         E
0       654  0.004619  0.993468  0.613271  0.856091
1  0.550326  0.541972  0.035519  0.919676  0.805929

In [ ]:
newdf.loc[0,'A'] = 65445

In [ ]:
newdf.head()

          A         B         C         D         E
0     65445  0.004619  0.993468  0.613271  0.856091
1  0.550326  0.541972  0.035519  0.919676  0.805929
2   0.11348  0.912265  0.834788  0.270516  0.088622
3  0.591618  0.720607  0.322464  0.407124  0.189336
4  0.566862  0.613896  0.957715  0.243204  0.690205

In [ ]:
newdf = newdf.drop(0, axis=1)

KeyError: '[0] not found in axis'

In [ ]:
newdf.head()

In [ ]:
newdf.loc[[1,2],['C', 'D']]

In [ ]:
newdf.head()

In [ ]:
newdf.loc[:,['C', 'D']]

In [ ]:
newdf.loc[[1,2], :]